# Создать множество произвольного содержания. После каждой операции выводить множество на экран
# Добавить 34 во множество.
# Удалить 34 из множества

sett = {111, 222, 333, 444}
print(sett)

sett.add(34)
print(sett)

sett.remove(34)
print(sett)

