# Даны 2 действительных числа a и b. Получить их сумму, разность и произведение.

a = 20
b = 10
# Сумма
print(a + b)

# Разность
print(a - b)

# Произведение
print(a * b)
