# Даны действительные числа x и y. Получить
# Для нахождения модуля использовать функцию abs(..)

x = 10
y = 20

a = abs(x)
b = abs(y)

print((a - b) / (1 + (a * b)))

