# Дана длина ребра куба. Найти объем куба и площадь всей его поверхности.

cube_edge_length = 40

# Объем куба v
v_cube = cube_edge_length ** 3
print(v_cube)

# Площадб всех поверхностей куба s
s_cube = 6 * cube_edge_length ** 2
print(s_cube)
