# Ввести с клавиатуры имя пользователя.
# Вывести на экран “Hello, [name]!”

print('Введите имя пользователя:')
string = input()
print(f'Hello, {string}!')
