# Создать три переменные, содержащие возраст трех человек, найти сумму и вывести ее на экран.
# Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран


hum_01 = 24
hum_02 = 77
hum_03 = 13

print(hum_01 + hum_02 + hum_03)

print(114 / 3)
