# Выведите на экран n раз фразу "I am a programmer". Число n вводит пользователь.

text = int(input('Введите кол-во повторений: '))
print('I am a programmer ' * text)