# Дан произвольный список, содержащий только числа. Выведите результат сложения всех чисел больше 10.

my_count = [30, 10, 7, 50, 100]
for i in my_count:
    if i > 9:
        print(int(i))



