# Выведите на экран n раз фразу "I am a programmer". Число n вводит пользователь.
#

my_str = ("I am a programmer")
n = int(input("Сколько раз повторить? "))

for i in range(n):
    print(my_str)
