# Создать произвольную строку. Получить подстроку с нечетными элементами.
# Написать два решения с использованием полной и сокращенной записи.

str = 'Это произвольная строка для выполнения задания'
print(str[0:len(str):2])
print(str[::2])