#Создать произвольную строку. Получить подстроку с начала и до седьмого элемента.
#Написать два решения с использованием полной и сокращенной записи.

str = 'Это произвольная строка для выполнения задания'
print (str)
print (str [0:6])