#Создать произвольную строку. Получить подстроку с начала и до седьмого элемента.
#Написать два решения с использованием полной и сокращенной записи.

str = 'Это произвольная строка для выполнения задания'
print (str [0:])
print (str [0:7])