# Создать произвольную строку. Получить подстроку с третьего элемента и до конца.
# Написать два решения с использованием полной и сокращенной записи.

str = 'Это произвольная строка для выполнения задания'

print(str[2:len(str):1])
print(str[2:])
