# Создать переменные firstname, lastname, age с соответствующими значениями
# Путем сложения получить строку вида:
# Привет, меня зовут Иван Иванович, мне 35 лет
# Вывести на экран саму строку и длину строки

firstname = "Александр"
lastname = "Менделев"
age = '24'
full_text = f'Привет, меня зовут {firstname} {lastname} мне {age} лет'

print(full_text)
print(len(full_text))
